РасширениеГТС/Джитиис/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
		</Properties>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПеремещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ASP_ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ПеремещениеТоваров/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("ТекстЗапросаВтТовары")
Функция асп_ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)
	//++ASP_Crow 11.03.2026 000029567 в расширение
	
	ИмяРегистра = "ВтТовары";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.ЗаказНаПеремещение       КАК ЗаказНаПеремещение,
	|	ТаблицаТовары.КодСтроки                КАК КодСтроки,
	|	ТаблицаТовары.Количество               КАК Количество,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.НазначениеОтправителя    КАК НазначениеОтправителя,
	|	ВЫБОР КОГДА &ПоЗаказуНаПеремещение ТОГДА
	|			ТоварыЗаказа.ВариантОбеспечения
	|	КОНЕЦ                                  КАК ВариантОбеспечения
	|
	|ПОМЕСТИТЬ ВтТовары
	|
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
	|
	#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыЗаказа
	#КонецУдаления
	#Вставка
	//ASP_Dante 10/11/21 Задача 000013136
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ТоварыЗаказа.Номенклатура             КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика           КАК Характеристика,
	|	ТоварыЗаказа.Ссылка       КАК Ссылка,
	|	ТоварыЗаказа.КодСтроки                КАК КодСтроки,
	|	ТоварыЗаказа.ВариантОбеспечения КАК ВариантОбеспечения
	|	 ИЗ Документ.ЗаказНаПеремещение.Товары КАК ТоварыЗаказа Сгруппировать ПО ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Ссылка,
	|	ТоварыЗаказа.КодСтроки,
	|	ТоварыЗаказа.ВариантОбеспечения) КАК ТоварыЗаказа
	//ASP_Dante 10/11/21
	#КонецВставки
	|		ПО ТаблицаТовары.ЗаказНаПеремещение= ТоварыЗаказа.Ссылка
	|			И ТаблицаТовары.Номенклатура   = ТоварыЗаказа.Номенклатура
	|			И ТаблицаТовары.Характеристика = ТоварыЗаказа.Характеристика
	|			И ТаблицаТовары.КодСтроки      = ТоварыЗаказа.КодСтроки
	|			И &ПоЗаказуНаПеремещение
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра); 
	Возврат ТекстЗапроса;
	
КонецФункции
